Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.Info2 Property
 The Info 2 field of the ProjectInfo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Info2 { get; set; }
Public Property Info2 As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace